app/views/base/_noncompany.html.erb

  function SearchForJobs() {
    let location = document.getElementById('loaction_').innerHTML.includes("Location") ?
---
SELECT "locations".* FROM "locations"