app/views/jobs/_applicatns.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <td>
                <% if candidate.user.biography.length > 1 %>