app/controllers/applicants_controller.rb

  def index
    @applicants = Applicant.all
---
SELECT "applicants".* FROM "applicants"