app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas"
---
  def index
    @areas = Area.all

INSERT INTO "areas" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Marketing"], ["created_at", "2019-12-10 10:29:12.645582"], ["updated_at", "2019-12-10 10:29:12.645582"]]
---
  def create
    @area = Area.new(area_params)

    respond_to do |format|
      if @area.save

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_area
      @area = Area.find(params[:id])