app/controllers/base_controller.rb

    def index
        if user_signed_in?
            if(current_user.company?)
                @jobs = Job.where({ user: current_user })
                render :template => "base/_company"
            else
                @locations = Location.all
                @areas = Area.all
---
SELECT "locations".* FROM "locations"
SELECT "areas".* FROM "areas"