app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

INSERT INTO "candidates" ("created_at", "updated_at", "job_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-12-22 19:03:57.665278"], ["updated_at", "2019-12-22 19:03:57.665278"], ["job_id", 5], ["user_id", 3]]
---
    def apply
        @candidate = Candidate.new(job_id: request.GET['id'])
        @candidate.user_id = current_user.id

        if @candidate.save

INSERT INTO "candidates" ("created_at", "updated_at", "job_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-12-22 18:38:04.822240"], ["updated_at", "2019-12-22 18:38:04.822240"], ["job_id", 4], ["user_id", 3]]
---
  def create
    @candidate = Candidate.new(candidate_params)
    @candidate.user_id = current_user.id

    respond_to do |format|
      if @candidate.save

DELETE FROM "candidates" WHERE "candidates"."id" = $1  [["id", 1]]
---
  def destroy
    @candidate.destroy

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_candidate
      @candidate = Candidate.find(params[:id])