app/controllers/jobs_controller.rb

  def index
    if(request.GET[:filter])
        filter = request.GET[:filter]
        @jobs = Job.where('LOWER(title) LIKE ?', "%#{filter}%")
    elsif (request.GET[:o] && request.GET[:t])
        order = request.GET[:o]
        type = request.GET[:t]
        if order == 'alph'
            @jobs = Job.order(title: :"#{type}")
        else
            @jobs = Job.order(created_at: :"#{type}")
        end

    else
        @jobs = Job.all
    end

    @applied = []

    if user_signed_in?
        if(!current_user.company?)
            @applied = Candidate.where(user: current_user).select(:job_id).map { |n| n["job_id"] }
---
SELECT  "candidates"."id", "candidates"."job_id" FROM "candidates" WHERE "candidates"."user_id" = 1 LIMIT $1  [["LIMIT", 1]]

  def applicants
    @job = Job.find(params[:id])
    @candidates = Candidate.where(job_id: params[:id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."job_id" = $1  [["job_id", 5]]