app/controllers/jobs_controller.rb

SELECT "applicants".* FROM "applicants" WHERE "applicants"."jobs_id" = $1  [["jobs_id", 5]]
---
  def applicants
    @applicants = Applicant.all