app/controllers/locations_controller.rb

INSERT INTO "locations" ("title", "postcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Velenje"], ["postcode", "3320"], ["created_at", "2019-12-10 10:26:42.086439"], ["updated_at", "2019-12-10 10:26:42.086439"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_location
      @location = Location.find(params[:id])