app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Fajn stvar"], ["content", "Dans sm peku kruh"], ["created_at", "2019-11-13 07:57:22.373589"], ["updated_at", "2019-11-13 07:57:22.373589"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "nek nov opis"], ["updated_at", "2019-10-22 11:10:53.360412"], ["id", 1]]

  def destroy
    respond_to do |format|
      if (current_user.id == @post.user)
        @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]